# IsRebarInSection Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarInSystem..::..IsRebarInSection Method
RebarInSystem Class See Also
---
Identifies if this RebarInSystem is shown as a cross-section in the given view.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool IsRebarInSection(
	View dBView
)
```

Visual Basic
---
```text
Public Function IsRebarInSection ( _
	dBView As View _
) As Boolean
```

Visual C++
---
```text
public:
bool IsRebarInSection(
	View^ dBView
)
```

# ### Parameters
dBView
    Type: Autodesk.Revit.DB..::..View The view.
# ### Return Value
True if this RebarInSystem is shown as a cross-section, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace